rokath/trice/test/Backup/TASKING_STM32F4DISC_Audio_Service/SoftwarePlatform/Configuration/drv_stm32_i2sm_cfg_instance.h
/*
 *  Software Platform Generated File
 *  --------------------------------
 */

#ifndef _SWP_DRV_STM32_I2SM_CFG_INSTANCE_H
#define _SWP_DRV_STM32_I2SM_CFG_INSTANCE_H

#include "drv_stm32_i2sm_cfg.h"

#include <stdint.h>
#include "per_stm32f4xx_i2s_cfg_instance.h"

#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_VERYHIGH  DMA_Priority_VeryHigh
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_HIGH  DMA_Priority_High
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_MEDIUM  DMA_Priority_Medium
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_LOW  DMA_Priority_Low

#define DRV_STM32_I2SM_INSTANCE_I2S_MODE_TRANSMIT  I2S_Mode_MasterTx
#define DRV_STM32_I2SM_INSTANCE_I2S_MODE_RECEIVE  I2S_Mode_MasterRx

#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_PHILIPS  I2S_Standard_Phillips
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_MSB  I2S_Standard_MSB
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_LSB  I2S_Standard_LSB
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_PCMSHORT  I2S_Standard_PCMShort
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_PCMLONG  I2S_Standard_PCMLong

#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_16BIT  I2S_DataFormat_16b
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_16BITEXT  I2S_DataFormat_16bextended
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_24BIT  I2S_DataFormat_24b
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_32BIT  I2S_DataFormat_32b

#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_96KHZ  I2S_AudioFreq_96k
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_48KHZ  I2S_AudioFreq_48k
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_44KHZ  I2S_AudioFreq_44k
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_32KHZ  I2S_AudioFreq_32k
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_22KHZ  I2S_AudioFreq_22k
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_16KHZ  I2S_AudioFreq_16k
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_11KHZ  I2S_AudioFreq_11k
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_8KHZ  I2S_AudioFreq_8k

#define DRV_STM32_I2SM_INSTANCE_I2S_CPOL_LOW  I2S_CPOL_Low
#define DRV_STM32_I2SM_INSTANCE_I2S_CPOL_HIGH  I2S_CPOL_High

#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_VERYHIGH_USED  0
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_HIGH_USED  1
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_MEDIUM_USED  0
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_LOW_USED  0
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_OPTIONS_USED  1
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_MIN  DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_HIGH
#define DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_MAX  DRV_STM32_I2SM_INSTANCE_DMA_PRIORITY_HIGH

#define DRV_STM32_I2SM_INSTANCE_I2S_MODE_TRANSMIT_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_MODE_RECEIVE_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_MODE_OPTIONS_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_MODE_MIN  DRV_STM32_I2SM_INSTANCE_I2S_MODE_TRANSMIT
#define DRV_STM32_I2SM_INSTANCE_I2S_MODE_MAX  DRV_STM32_I2SM_INSTANCE_I2S_MODE_TRANSMIT

#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_PHILIPS_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_MSB_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_LSB_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_PCMSHORT_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_PCMLONG_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_OPTIONS_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_MIN  DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_PHILIPS
#define DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_MAX  DRV_STM32_I2SM_INSTANCE_I2S_STANDARD_PHILIPS

#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_16BIT_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_16BITEXT_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_24BIT_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_32BIT_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_OPTIONS_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_MIN  DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_16BIT
#define DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_MAX  DRV_STM32_I2SM_INSTANCE_I2S_DATAFORMAT_16BIT

#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_96KHZ_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_48KHZ_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_44KHZ_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_32KHZ_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_22KHZ_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_16KHZ_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_11KHZ_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_8KHZ_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_OPTIONS_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_MIN  DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_22KHZ
#define DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_MAX  DRV_STM32_I2SM_INSTANCE_I2S_AUDIOFREQ_22KHZ

#define DRV_STM32_I2SM_INSTANCE_I2S_CPOL_LOW_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_CPOL_HIGH_USED  0
#define DRV_STM32_I2SM_INSTANCE_I2S_CPOL_OPTIONS_USED  1
#define DRV_STM32_I2SM_INSTANCE_I2S_CPOL_MIN  DRV_STM32_I2SM_INSTANCE_I2S_CPOL_LOW
#define DRV_STM32_I2SM_INSTANCE_I2S_CPOL_MAX  DRV_STM32_I2SM_INSTANCE_I2S_CPOL_LOW


// instance data
typedef struct
{
        int dma_priority;
        uint16_t i2s_mode;
        uint16_t i2s_standard;
        uint16_t i2s_dataformat;
        uint32_t i2s_audiofreq;
        uint16_t i2s_cpol;
    int per_stm32_i2s;
} drv_stm32_i2sm_cfg_instance_t;

extern const drv_stm32_i2sm_cfg_instance_t drv_stm32_i2sm_instance_table[]; 

#endif /* _SWP_DRV_STM32_I2SM_CFG_INSTANCE_H */
